Edragon/WCH/CH56x/CH563EVT/EXAM/NET/MAIL/MAIL.C
#ifdef    receive_over_reply
                    p_pop3->AnalyMailDat = 1;                                   /* 接收邮件完成标志 */
                    CH563NET_AnalyseMailData( recv_buff );                      /* 分析邮件内容 */
                    OrderType = SMTP_SEND_START;
                }
                else{
                    p_pop3->AnalyMailDat = 0;
                    CH563NET_AnalyseMailData( recv_buff );
#endif    // receive_over_reply 
                }
                return (CHECK_SUCCESS);
            } 
            return POP_ERR_RETR;
        case POP_CHECK_DELE:                                                    /* 删除 */
            if(strncmp("+OK", recv_buff, 3) == 0){
                OrderType = POP_RECEIVE_QUIT;                                   /* 执行完后不执行其他命令，如需可自行选择下一条命令 */
                return (CHECK_SUCCESS);
            }
            return POP_ERR_DELE;
        case POP_CHECK_RSET:                                                    /* 撤销删除 */ 
            if(strncmp("+OK", recv_buff, 3) == 0){
                OrderType = POP_RECEIVE_QUIT;                                   /* 执行完后不执行其他命令，如需可自行选择下一条命令 */
                return (CHECK_SUCCESS);
            }
            return POP_ERR_RSET;
        case POP_CHECK_TOP:        // 
            if(strncmp("+OK", recv_buff, 3) == 0){
                OrderType = POP_RECEIVE_QUIT;                                   /* 执行完后不执行其他命令，如需可自行选择下一条命令 */
                return (CHECK_SUCCESS);
            }
            if(strncmp("Return", recv_buff, 6) == 0){
                OrderType = POP_RECEIVE_QUIT;                                   /* 执行完后不执行其他命令，如需可自行选择下一条命令 */
                return (CHECK_SUCCESS);
            } 
            return POP_ERR_TOP;
        case POP_CHECK_UIDL:    //
            if(strncmp("+OK", recv_buff, 3) == 0){
                OrderType = POP_RECEIVE_QUIT;                                   /* 执行完后不执行其他命令，如需可自行选择下一条命令 */
                return (CHECK_SUCCESS);
            }
            return POP_ERR_UIDL;
#endif    // receive_mail
        default:
            return SMTP_ERR_UNKNOW;
    }
}
/*******************************************************************************
* Function Name  : CH563NET_MailQuery
* Description    : 状态查询
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void CH563NET_MailQuery( void )
{
    if( p_pop3->DiscnntFlag == 1){
        p_pop3->DiscnntFlag = 0;
#ifdef    POP_REFRESH
        if(p_pop3->RefreshTime){
            p_pop3->RefreshTime = 0;
            Delay_ms(200);
            CH563NET_CreatTcpPop3( ); 
        } 
#endif
    }
    if(ReceDatFlag){
#ifdef    POP_RTER                                                                                                               
        if(OrderType == POP_RECEIVE_RTER ){
            ReceDatFlag = 0;    
            CH563NET_POP3Retr( '1' );                                           /* 处理server邮件的全部文本内容    （输入邮件号） */
        }
#endif
#ifdef    POP_DELE 
        if(OrderType == POP_RECEIVE_DELE ){
            ReceDatFlag = 0;    
            CH563NET_POP3Dele( '1' );                                           /* 处理server标记删除，QUIT命令执行时才真正删除（输入邮件号） */
        }
#endif
#ifdef    POP_RSET 
        if(OrderType == POP_RECEIVE_RSET ){ 
            ReceDatFlag = 0;    
            CH563NET_POP3Rset(  );                                              /* 处理撤销所有的DELE命令 */
        }
#endif
#ifdef    POP_TOP 
        if(OrderType == POP_RECEIVE_TOP ){
            ReceDatFlag = 0;    
            CH563NET_POP3Top( '1','3' );                                        /* 返回n号邮件的前m行内容(输入邮件号,行号(必须为自然数)) */
        }
#endif
#ifdef    POP_UIDL 
        if(OrderType == POP_RECEIVE_UIDL ){
            ReceDatFlag = 0;    
            CH563NET_POP3Uidl( '1' );                                           /* 处理server返回用于该指定邮件的唯一标识，如果没有指定，返回所有的。（输入邮件号）*/
        }
#endif
    }

}

/*********************************** endfile **********************************/
